<?php

return [
    'importers' => [
        'persons' => [
            'title' => 'បុគ្គល',

            'validation' => [
                'errors' => [
                    'duplicate-email' => 'អ៊ីមែល : \'%s\' ត្រូវបានរកឃើញច្រើនជាងមួយដងនៅក្នុងឯកសារនាំចូល។',
                    'duplicate-phone' => 'លេខទូរស័ព្ទ : \'%s\' ត្រូវបានរកឃើញច្រើនជាងមួយដងនៅក្នុងឯកសារនាំចូល។',
                    'email-not-found' => 'មិនបានរកឃើញអ៊ីមែល : \'%s\' នៅក្នុងប្រព័ន្ធទេ។',
                ],
            ],
        ],

        'products' => [
            'title' => 'ផលិតផល',

            'validation' => [
                'errors' => [
                    'sku-not-found' => 'មិនបានរកឃើញផលិតផលដែលមាន SKU បានបញ្ជាក់ទេ',
                ],
            ],
        ],

        'leads' => [
            'title' => 'លីដ',

            'validation' => [
                'errors' => [
                    'id-not-found' => 'មិនបានរកឃើញ ID : \'%s\' នៅក្នុងប្រព័ន្ធទេ។',
                ],
            ],
        ],
    ],

    'validation' => [
        'errors' => [
            'column-empty-headers' => 'ជួរឈរលេខ "%s" មានក្បាលជួរឈរទទេ។',
            'column-name-invalid' => 'ឈ្មោះជួរឈរមិនត្រឹមត្រូវ៖ "%s"។',
            'column-not-found' => 'មិនបានរកឃើញជួរឈរដែលត្រូវការ៖ %s។',
            'column-numbers' => 'ចំនួនជួរឈរមិនស្របនឹងចំនួនជួរដេកនៅក្នុងក្បាលតារាងទេ។',
            'invalid-attribute' => 'ក្បាលតារាងមានគុណលក្ខណៈមិនត្រឹមត្រូវ៖ "%s"។',
            'system' => 'មានកំហុសប្រព័ន្ធមិនរំពឹងទុកមួយបានកើតឡើង។',
            'wrong-quotes' => 'បានប្រើសញ្ញាសម្រង់កោងជំនួសសញ្ញាសម្រង់ត្រង់។',
            'already-exists' => ':attribute មានរួចហើយ។',
        ],
    ],
];
